docs/proofs/tickets/issue-222-governed-skill-live-proofs-20260728T155857Z/bounded-mutation/code-runner.patch
diff --git a/src/app.py b/src/app.py
index 8d96fe4..fe81f17 100644
--- a/src/app.py
+++ b/src/app.py
@@ -1,2 +1,2 @@
 def add_one(x):
-    return x + 2
+    return x + 1
